---
kind: method
id: M:Autodesk.Revit.DB.SlabShapeCreaseArray.ReverseIterator
source: html/8b397860-2f53-c81a-260c-6fa6f86e30ab.htm
---
# Autodesk.Revit.DB.SlabShapeCreaseArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual SlabShapeCreaseArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.